; domain
(define (domain maintenance-scheduling)
  (:requirements :strips :typing)
  (:types inhabitant room time)
  
  (:predicates 
    (available ?i - inhabitant ?t - time)   ; Inhabitant ?i can arrive at time ?t
    (time-slot-free ?t - time)              ; The time slot ?t is not yet used
    (roomFor ?i - inhabitant ?r - room)       ; Inhabitant ?i is assigned room ?r
    (scheduled ?i - inhabitant)             ; Inhabitant ?i has been set up
  )
  
  (:action showRoom
    :parameters (?t - time ?i - inhabitant ?r - room)
    :precondition (and
                    (available ?i ?t)
                    (time-slot-free ?t)
                    (roomFor ?i ?r))
    :effect (and
             (scheduled ?i)
             (not (time-slot-free ?t)))
  )
)

; problem
(define (problem scheduling-problem)
(:domain maintenance-scheduling)
  (:objects
    inhabitant1 inhabitant2 inhabitant3 inhabitant4 inhabitant5
    inhabitant6 inhabitant7 inhabitant8 inhabitant9 inhabitant10 - inhabitant

    room1 room2 room3 room4 room5 room6 room7 room8 room9 room10 - room

    am9 am915 am930 am945 am1000 am1015 am1030 am1045 am1100 am1115 am1130 - time
  )
  (:init
    ;; Inhabitants’ available time slots (with overlapping options):
    (available inhabitant1 am9)
    (available inhabitant1 am915)
    
    (available inhabitant2 am9)
    (available inhabitant2 am930)
    
    (available inhabitant3 am930)
    (available inhabitant3 am945)
    
    (available inhabitant4 am945)
    (available inhabitant4 am1000)
    
    (available inhabitant5 am1000)
    (available inhabitant5 am1015)
    
    (available inhabitant6 am1015)
    
    (available inhabitant7 am1000)
    (available inhabitant7 am1030)
    (available inhabitant7 am1045)
    (available inhabitant7 am1100)
    
    (available inhabitant8 am1045)
    (available inhabitant8 am1100)
    
    (available inhabitant9 am1100)

    (available inhabitant10 am1115)
    (available inhabitant10 am1130)
    
    ;; Room assignments for each inhabitant:
    (roomFor inhabitant1 room1)
    (roomFor inhabitant2 room2)
    (roomFor inhabitant3 room3)
    (roomFor inhabitant4 room4)
    (roomFor inhabitant5 room5)
    (roomFor inhabitant6 room6)
    (roomFor inhabitant7 room7)
    (roomFor inhabitant8 room8)
    (roomFor inhabitant9 room9)
    (roomFor inhabitant10 room10)
    
    ;; All time slots are initially free:
    (time-slot-free am9)
    (time-slot-free am915)
    (time-slot-free am930)
    (time-slot-free am945)
    (time-slot-free am1000)
    (time-slot-free am1015)
    (time-slot-free am1030)
    (time-slot-free am1045)
    (time-slot-free am1100)
    (time-slot-free am1115)
    (time-slot-free am1130)
  )
  (:goal (and
           (scheduled inhabitant1)
           (scheduled inhabitant2)
           (scheduled inhabitant3)
           (scheduled inhabitant4)
           (scheduled inhabitant5)
           (scheduled inhabitant6)
           (scheduled inhabitant7)
           (scheduled inhabitant8)
           (scheduled inhabitant9)
           (scheduled inhabitant10)
         ))
)

; plan
1. (showroom am1015 inhabitant6 room6)
   deleted: (time-slot-free am1015)
   added: (scheduled inhabitant6)
   goals met: 1 of 10
2. (showroom am1130 inhabitant10 room10)
   deleted: (time-slot-free am1130)
   added: (scheduled inhabitant10)
   goals met: 2 of 10
3. (showroom am1100 inhabitant9 room9)
   deleted: (time-slot-free am1100)
   added: (scheduled inhabitant9)
   goals met: 3 of 10
4. (showroom am9 inhabitant2 room2)
   deleted: (time-slot-free am9)
   added: (scheduled inhabitant2)
   goals met: 4 of 10
5. (showroom am915 inhabitant1 room1)
   deleted: (time-slot-free am915)
   added: (scheduled inhabitant1)
   goals met: 5 of 10
6. (showroom am930 inhabitant3 room3)
   deleted: (time-slot-free am930)
   added: (scheduled inhabitant3)
   goals met: 6 of 10
7. (showroom am1045 inhabitant8 room8)
   deleted: (time-slot-free am1045)
   added: (scheduled inhabitant8)
   goals met: 7 of 10
8. (showroom am1030 inhabitant7 room7)
   deleted: (time-slot-free am1030)
   added: (scheduled inhabitant7)
   goals met: 8 of 10
9. (showroom am1000 inhabitant5 room5)
   deleted: (time-slot-free am1000)
   added: (scheduled inhabitant5)
   goals met: 9 of 10
10. (showroom am945 inhabitant4 room4)
   deleted: (time-slot-free am945)
   added: (scheduled inhabitant4)
   goals met: 10 of 10
